tap "homebrew/bundle"
tap "hashicorp/tap"

# Make sure apps get installed in system Applications dir
cask_args appdir: '/Applications', require_sha: true

# Install ZSH
brew 'zsh'
brew 'zsh-completions'

# Install GNU core utilities (those that come with OS X are outdated)
brew 'coreutils'

# Install Bash 4
brew 'bash'

# CLI tools
brew "git"
brew "wget"
brew "mackup"
brew "hashicorp/tap/terraform"
brew "terragrunt"
brew "node"
brew "yarn"
brew "python"
brew "pipenv"
brew "python@3.10"
brew "python@3.11"
brew "ssh-copy-id"
brew "rclone"
brew "telnet"
brew "jq"
brew "nmap"
brew "ffmpeg"

# Neovim
brew "neovim"
brew "make"
brew "unzip"
brew "gcc"
brew "ripgrep"

# Containers
brew "docker"
brew "docker-compose"
# brew "podman"
brew "docker-buildx"
# docker-buildx is a Docker plugin. For Docker to find this plugin, symlink it:
# mkdir -p ~/.docker/cli-plugins
# ln -sfn $HOMEBREW_PREFIX/opt/docker-buildx/bin/docker-buildx ~/.docker/cli-plugins/docker-buildx

# Helm charts library
brew "yq"
brew "go-task"
brew "helm-docs@1.11.0"
brew "chart-testing"
brew "helm"

brew "colima"
# brew "kubectl"
cask "utm"
# brew "helm"
# brew "octant"
# brew "tailscale"

# Java
brew "openjdk@11"
brew "openjdk@17"
brew "openjdk@23"
brew "jenv"
brew "mvn"

# Apps
cask "rectangle"
cask "visual-studio-code"
cask "jetbrains-toolbox"
cask "iterm2"
cask "obsidian"
cask "transmission"
cask "synology-drive"
# cask "calibre"
cask "google-drive"
cask "steam"
cask "spotify"
cask "sonos"
cask "arduino-ide"
cask "gnucash"
cask "telegram"
cask "slack"
cask "drawio"
cask "maccy"
cask "raycast"
cask "deskpad" # virtual screen for screensharing

# 3D printing
cask "prusaslicer"
# cask "autodesk-fusion360"

# Work
cask "citrix-workspace"

# VMs
cask "multipass"

# Drone flying
cask "handbrake"

# Blog
brew "hugo"
