tap "homebrew/bundle"

# Make sure apps get installed in system Applications dir
cask_args appdir: '/Applications'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'

# Install GNU core utilities (those that come with OS X are outdated)
brew 'coreutils'

# Install Bash 4
brew 'bash'

# CLI tools
brew "git"
brew "wget"
brew "mackup"
brew "docker"
brew "colima"

# Java
brew "openjdk@11"
brew "openjdk@17"
brew "jenv"

tap "homebrew/cask"

# Apps
cask "rectangle"
cask "visual-studio-code"
cask "jetbrains-toolbox"
cask "iterm2"

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'
