tap "homebrew/bundle"

# Make sure apps get installed in system Applications dir
cask_args appdir: '/Applications'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'

# Install GNU core utilities (those that come with OS X are outdated)
brew 'coreutils'

# Install Bash 4
brew 'bash'

# CLI tools
brew "git"
brew "wget"
brew "mackup"
brew "terraform"
brew "terragrunt"
brew "node"
brew "yarn"
brew "python"
brew "pipenv"
brew "python@3.10"
brew "ssh-copy-id"
brew "rclone"
brew "telnet"
brew "jq"
brew "nmap"

# Containers
brew "docker"
brew "docker-compose"
# brew "podman"

brew "docker-buildx"
# docker-buildx is a Docker plugin. For Docker to find this plugin, symlink it:
# mkdir -p ~/.docker/cli-plugins
# ln -sfn $HOMEBREW_PREFIX/opt/docker-buildx/bin/docker-buildx ~/.docker/cli-plugins/docker-buildx

brew "colima"
brew "kubectl"
brew "helm"
brew "octant"

# Java
brew "openjdk@11"
brew "openjdk@17"
brew "jenv"
brew "mvn"

# Apps
cask "rectangle"
cask "visual-studio-code"
cask "jetbrains-toolbox"
cask "iterm2"
cask "obsidian"
cask "openlens"
cask "transmission"
cask "tunnelblick"
cask "synology-drive"
cask "calibre"
cask "google-drive"
cask "steam"
cask "spotify"

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# 3D printing
cask "prusaslicer"
cask "autodesk-fusion360"

# Genesis
# brew "bento4"
# cask "google-cloud-sdk"
# brew "go"

# Magenta
cask "skype"
cask "libreoffice"
cask "citrix-workspace"
# cask "ansible"

# Drone flying
cask "handbrake"

# Google Takeout
# tap "dart-lang/dart"
# brew "dart"

# Blog
brew "hugo"
